ATsupportum/src/Catalogs/Доступы_ат/Доступы_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Доступы_ат</name>
  <owners>Catalog.ЭкземплярыПродуктов_ат</owners>
  <attributes>
    <name>ТипДоступа</name>
    <type>
      <types>EnumRef.ТипыДоступа_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Catalog>

ATsupportum/src/Enums/ТипыДоступа_ат/ТипыДоступа_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДоступа_ат</name>
  <enumValues>
    <name>Администратор</name>
  </enumValues>
  <enumValues>
    <name>АдминистраторБД</name>
  </enumValues>
  <enumValues>
    <name>АдминистраторИБ</name>
  </enumValues>
  <enumValues>
    <name>АдминистраторКластераСерверов1С</name>
  </enumValues>
  <enumValues>
    <name>АдминистраторСервера1С</name>
  </enumValues>
  <enumValues>
    <name>ДоступИБкБД</name>
  </enumValues>
  <enumValues>
    <name>Пользователь</name>
  </enumValues>
  <enumValues>
    <name>ПользовательИБ</name>
  </enumValues>
</mdclass:Enum>

ATsupportum/src/Enums/ТипыРолейСерверов_ат/ТипыРолейСерверов_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыРолейСерверов_ат</name>
  <enumValues>
    <name>РазмещениеОС</name>
  </enumValues>
  <enumValues>
    <name>СерверТерминалов</name>
  </enumValues>
  <enumValues>
    <name>Сервер1С</name>
  </enumValues>
  <enumValues>
    <name>СерверБД</name>
  </enumValues>
  <enumValues>
    <name>СерверФайловый</name>
  </enumValues>
  <enumValues>
    <name>СерверFTP</name>
  </enumValues>
  <enumValues>
    <name>СерверВеб</name>
  </enumValues>
  <enumValues>
    <name>СерверПрочий</name>
  </enumValues>
  <enumValues>
    <name>СерверАрхивныхДанных</name>
  </enumValues>
</mdclass:Enum>

ATsupportum/src/Enums/ТипыПродуктов_ат/ТипыПродуктов_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПродуктов_ат</name>
  <enumValues>
    <name>Документация</name>
  </enumValues>
  <enumValues>
    <name>ДокументацияПП1С</name>
  </enumValues>
  <enumValues>
    <name>КлиентскаяЛицензия1С</name>
  </enumValues>
  <enumValues>
    <name>КлиентскаяЛицензияПП1С</name>
  </enumValues>
  <enumValues>
    <name>КлиентскийДоступMSSQLServer</name>
  </enumValues>
  <enumValues>
    <name>КлючUSB1С</name>
  </enumValues>
  <enumValues>
    <name>КлючUSBКонфигурации1С</name>
  </enumValues>
  <enumValues>
    <name>Книга</name>
  </enumValues>
  <enumValues>
    <name>Конфигурация1С</name>
  </enumValues>
  <enumValues>
    <name>Отчетность</name>
  </enumValues>
  <enumValues>
    <name>Платформа1С</name>
  </enumValues>
  <enumValues>
    <name>ПрочийПП</name>
  </enumValues>
  <enumValues>
    <name>ПрочийППMS</name>
  </enumValues>
  <enumValues>
    <name>Сервер_nix</name>
  </enumValues>
  <enumValues>
    <name>Сервер1С</name>
  </enumValues>
  <enumValues>
    <name>СерверIBMDB2</name>
  </enumValues>
  <enumValues>
    <name>СерверMSSQL</name>
  </enumValues>
  <enumValues>
    <name>СерверMSWindows</name>
  </enumValues>
  <enumValues>
    <name>СерверOracle</name>
  </enumValues>
  <enumValues>
    <name>СерверPostgreSQL</name>
  </enumValues>
  <enumValues>
    <name>СерверВеб</name>
  </enumValues>
  <enumValues>
    <name>УдаленныйДоступMSServer</name>
  </enumValues>
</mdclass:Enum>

ATsupportum/src/Catalogs/ЭкземплярыПродуктов_ат/ЭкземплярыПродуктов_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭкземплярыПродуктов_ат</name>
  <owners>Catalog.ПоставкиПродуктов_ат</owners>
  <attributes>
    <name>КлиентАрендатор</name>
    <type>
      <types>CatalogRef.Контрагенты_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РольСервераРазмещения</name>
    <type>
      <types>CatalogRef.РолиСерверов_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>СерверРазмещения</name>
    <type>
      <types>CatalogRef.Серверы_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсия</name>
    <type>
      <types>CatalogRef.ВерсииПродуктов_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийПродукт</name>
    <type>
      <types>CatalogRef.Продукты_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_КомментарийВнутренний</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскийЭП</name>
    <comment>//!!!!!HOTFIX</comment>
    <type>
      <types>CatalogRef.ЭкземплярыПродуктов_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРодительскогоЭП</name>
    <comment>//!!!!!HOTFIX</comment>
    <type>
      <types>EnumRef.ТипыРодительскогоЭП_ат</types>
    </type>
  </attributes>
</mdclass:Catalog>

ATsupportum/src/Catalogs/Доступы_ат/ManagerModule.bsl
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = Строка(Данные.Ссылка.ТипДоступа) + " - " + Данные.Ссылка.Логин + " - " + Данные.Ссылка.Наименование;
	
КонецПроцедуры

&НаСервере
Функция   ПолучитьАдминистративныеДоступыКОССервера(Сервер) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Доступы.Логин,
	|	Доступы.Пароль,
	|	Доступы.Ссылка
	|ИЗ
	|	Справочник.Доступы_ат КАК Доступы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭкземплярыПродуктов_ат КАК ЭкземплярыПродуктов
	|		ПО Доступы.Владелец = ЭкземплярыПродуктов.Ссылка
	|ГДЕ
	|	Доступы.ТипДоступа = &ТипДоступа
	|	И НЕ Доступы.ПометкаУдаления
	|	И ЭкземплярыПродуктов.РольСервераРазмещения.Владелец = &Сервер
	|	И ЭкземплярыПродуктов.РольСервераРазмещения.ВидРолиСервера.ТипРолиСервера = &ТипРолиСервера
	|	И ЭкземплярыПродуктов.ТекущийПродукт.ТипПродукта В (&ТипПродукта)
	|	И НЕ ЭкземплярыПродуктов.ПометкаУдаления
	|";
	
	Запрос.УстановитьПараметр("Сервер", Сервер);
	Запрос.УстановитьПараметр("ТипДоступа", Перечисления.ТипыДоступа_ат.Администратор);
	Запрос.УстановитьПараметр("ТипРолиСервера", Перечисления.ТипыРолейСерверов_ат.РазмещениеОС);
	
	ТипыПродукта = Новый Массив;
	ТипыПродукта.Добавить(Перечисления.ТипыПродуктов_ат.СерверMSWindows);
	ТипыПродукта.Добавить(Перечисления.ТипыПродуктов_ат.Сервер_nix);
	Запрос.УстановитьПараметр("ТипПродукта", ТипыПродукта);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Стр = Новый Структура;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Стр.Вставить("Логин",  ВыборкаДетальныеЗаписи.Логин);
			Стр.Вставить("Пароль", ВыборкаДетальныеЗаписи.Пароль);
			Стр.Вставить("Доступ", ВыборкаДетальныеЗаписи.Ссылка);
		КонецЦикла;
		Возврат Стр;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция   ПолучитьДоступыКЭП(ЭП, ТипыДоступа = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Доступы.Логин,
	|	Доступы.Пароль,
	|	Доступы.Ссылка
	|ИЗ
	|	Справочник.ЭкземплярыПродуктов_ат КАК ЭкземплярыПродуктов_ат
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Доступы_ат КАК Доступы
	|		ПО ЭкземплярыПродуктов_ат.Ссылка = Доступы.Владелец
	|ГДЕ
	|	ЭкземплярыПродуктов_ат.Ссылка = &ЭП
	|	И (НЕ Доступы.ПометкаУдаления)";
	
	Если ТипыДоступа <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И Доступы.ТипДоступа В(&ТипыДоступа)";
		
		Запрос.УстановитьПараметр("ТипыДоступа", ТипыДоступа);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ЭП", ЭП);

	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Стр = Новый Структура;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Стр.Вставить("Логин",  ВыборкаДетальныеЗаписи.Логин);
			Стр.Вставить("Пароль", ВыборкаДетальныеЗаписи.Пароль);
			Стр.Вставить("Доступ", ВыборкаДетальныеЗаписи.Ссылка);
		КонецЦикла;
		Возврат Стр;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции
